app/views/users/show.html.erb

SELECT "my_habits".* FROM "my_habits" WHERE "my_habits"."user_id" = ?  [["user_id", 4]]
---
        <ol>
            <% @user.my_habits.each do |habit| %>