app/controllers/my_habits_controller.rb

INSERT INTO "my_habits" ("user_id", "habit_id", "frequency", "status", "notes") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["habit_id", 3], ["frequency", "daily"], ["status", 0], ["notes", "20 a day"]]
---
    def create
        @my_habit = MyHabit.new(my_habit_params)
        @my_habit.user_id = current_user.id

        if @my_habit.save