app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def create
        user = User.find_by(id: params[:user][:name])