app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest") VALUES (?, ?)  [["name", "Mickey"], ["password_digest", "$2a$12$YgPWlay.YfDiz0Kiv0eylO82rx1yUxaQeGmd3XJJ5LcJQM9iJkgKe"]]
INSERT INTO "users" ("name", "password_digest") VALUES (?, ?)  [["name", "Roger"], ["password_digest", "$2a$12$VMbe8ua.PS2EKtTwAophCe7.u/RxTkxhWWkB3kyVWb8dQHFr7Jpi."]]
---
    def create
        @user = User.create(user_params)
        flash[:notice] = @user.errors.messages
        return redirect_to '/signup' unless @user.save