app/models/my_habit.rb

    def habit_name=(name)
        self.habit = Habit.find_or_create_by(name: name)
---
INSERT INTO "habits" ("name") VALUES (?)  [["name", "push-ups"]]
SELECT  "habits".* FROM "habits" WHERE "habits"."name" = ? LIMIT ?  [["name", "coding"], ["LIMIT", 1]]