app/views/my_habits/new.html.erb

            <datalist id="habits_autocomplete">
                <% Habit.all.each do |habit| %>
---
SELECT "habits".* FROM "habits"